SOURCE:https://gist.github.com/pohzipohzi/75e950e4c6701b84c493c75f6ab338b8

In [0]:
First of all install library
#!pip install numpy
#!pip install pandas

Requirement already satisfied: numpy in /usr/local/lib/python3.6/dist-packages (1.17.4)

In [0]:
import numpy as np
import pandas as pd

# input output

In [0]:
## input
# df = pd.read_csv('data_2d.csv', header=None) # headers included by default

# df = pd.read_excel('Excel.xlsx',sheetname='Sheet1')

# data = pd.read_html('somelink') # returns a list
# don't use pandas to read sql (better alternatives available)

In [0]:
# output
# df.to_csv('out',index=False)

# df.to_excel('out.xlsx',sheet_name='NewSheet')

In [0]:
pip install ipynb-py-convert

Collecting ipynb-py-convert
  Downloading https://files.pythonhosted.org/packages/61/07/59855a8afc2da73f0bafbf89e09002ee0705fed0016ddf2acf062eb042f1/ipynb-py-convert-0.4.4.tar.gz
Building wheels for collected packages: ipynb-py-convert
  Building wheel for ipynb-py-convert (setup.py) ... done
  Created wheel for ipynb-py-convert: filename=ipynb_py_convert-0.4.4-cp36-none-any.whl size=4305 sha256=c456882399dfbf8b262c7304289c294bd2b2e66e42131c4ef9525cada42a6dfd
  Stored in directory: /root/.cache/pip/wheels/09/e6/42/6d99e7940e02e8ee20f81397bf5d6767a1bb6b564c32caef6c
Successfully built ipynb-py-convert
Installing collected packages: ipynb-py-convert
Successfully installed ipynb-py-convert-0.4.4

# creating dataframes, adding and dropping columns

In [0]:
#create data frame

#df = pd.DataFrame(np.arange(1,16).reshape(3,5),['A','B','C'],['w','x','y','z','p'])
#df = pd.DataFrame(np.arange(1,16).reshape(5,3),['A','B','C','D','E'],['w','x','y'])

df = pd.DataFrame(np.arange(1,10).reshape(3,3),['A','B','C'],['w','x','y'])
df

   w  x  y
A  1  2  3
B  4  5  6
C  7  8  9

In [0]:
df.columns = ['W','X','Y'] # change column names
df

   W  X  Y
A  1  2  3
B  4  5  6
C  7  8  9

In [0]:
# new column with values X+Y
df['Z']=df['X']+df['Y']
df

   W  X  Y   Z
A  1  2  3   5
B  4  5  6  11
C  7  8  9  17

In [0]:
# new column with values twice of column X
df['XX']=df.apply(lambda row: row['X']*2, axis=1)
df

   W  X  Y   Z  XX  YY
A  1  2  3   5   4   1
B  4  5  6  11  10   1
C  7  8  9  17  16   1

In [0]:
# new column of ones
df['YY']=1 
df

   W  X  Y   Z  XX  YY
A  1  2  3   5   4   1
B  4  5  6  11  10   1
C  7  8  9  17  16   1

In [0]:
# new column of '100's called 'D' at position 2 (3rd column)
df.insert(2, column='D', value=100) 
df

   W  X    D  Y   Z  XX  YY
A  1  2  100  3   5   4   1
B  4  5  100  6  11  10   1
C  7  8  100  9  17  16   1

In [0]:
# drop row
df.drop('B',axis=0, inplace=True) 
df

   W  X    D  Y   Z  XX  YY
A  1  2  100  3   5   4   1
C  7  8  100  9  17  16   1

In [0]:
# drop column
df.drop('Z',axis=1)
df

   W  X  Y   Z
A  1  2  3   5
B  4  5  6  11
C  7  8  9  17

In [0]:
# drop column and store series to a variable
Z = df.pop('Z')
Z

A     5
B    11
C    17
Name: Z, dtype: int64

#selecting from dataframes

***select columns***

In [0]:
df.X # column X (does not work when column name has spaces)

A    2
B    5
C    8
Name: X, dtype: int64

In [0]:
df['X'] # column X

A    2
B    5
C    8
Name: X, dtype: int64

In [0]:
df[['X','Y']] # columns X and Y

   X  Y
A  2  3
B  5  6
C  8  9

##select rows using loc and iloc

***can also use ix, but it's slightly tricky to use: https://stackoverflow.com/questions/31593201/pandas-iloc-vs-ix-vs-loc-explanation***

 ***ix is useful for mixing usage of loc and iloc (use both labels and positions at the same time)***

***returns a series if single row selected***

In [0]:
df.loc['A'] # row A

W    1
X    2
Y    3
Name: A, dtype: int64

In [0]:
df.loc['A':] # row A onwards

   W  X  Y
A  1  2  3
B  4  5  6
C  7  8  9

In [0]:
df.loc[:'X'] # until row X (inclusive!)

   W  X  Y
A  1  2  3
B  4  5  6
C  7  8  9

In [0]:
#df.loc['A','X'] # row A, column X
df.loc['B','X'] # row B, column X

5

In [0]:
df.loc[['A','doesnotexist']] # return row with NaN for doesnotexist, check if exists via "doesnotexist" in df.index

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

                W    X    Y
A             1.0  2.0  3.0
doesnotexist  NaN  NaN  NaN

In [0]:
df.loc[['A','C'],['X','Y']] # rows A and C, columns X and Y

   X  Y
A  2  3
C  8  9

***iloc***

In [0]:
df.iloc[0] # row at position 0

W    1
X    2
Y    3
Name: A, dtype: int64

In [0]:
df.iloc[:,0:3] # column from position 0 to before 3

   W  X  Y
A  1  2  3
B  4  5  6
C  7  8  9

In [0]:
df.iloc[[0,1],[0,1]] # rows 0 and 1, and columns 0 and 1

   W  X
A  1  2
B  4  5

# broadcasting operations

In [0]:
# == df['X'] + 5
df['X'].add(5)

A     7
B    10
C    13
Name: X, dtype: int64

In [0]:
# == df['X'] - 5 == df['X'].subtract(5)
df['X'].sub(5)

A   -3
B    0
C    3
Name: X, dtype: int64

In [0]:
# == df['X'] * 5 == df['X'].multiply(5)
df['X'].mul(5)

A    10
B    25
C    40
Name: X, dtype: int64

In [0]:
# == df['X'] / 5 == df['X'].divide(5)
df['X'].div(5)

A    0.4
B    1.0
C    1.6
Name: X, dtype: float64

# basic attributes and methods

In [0]:
import numpy as np
import pandas as pd

In [0]:
df = pd.DataFrame(np.arange(1,37).reshape(6,6),['A','B','C','D','E','F'],['w','x','y','p','q','r'])
df

    w   x   y   p   q   r
A   1   2   3   4   5   6
B   7   8   9  10  11  12
C  13  14  15  16  17  18
D  19  20  21  22  23  24
E  25  26  27  28  29  30
F  31  32  33  34  35  36

In [0]:
# general data exploration
df.info()  # type, index, columns, dtypes, memory usage - printed automatically
df

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, A to F
Data columns (total 6 columns):
w    6 non-null int64
x    6 non-null int64
y    6 non-null int64
p    6 non-null int64
q    6 non-null int64
r    6 non-null int64
dtypes: int64(6)
memory usage: 336.0+ bytes

    w   x   y   p   q   r
A   1   2   3   4   5   6
B   7   8   9  10  11  12
C  13  14  15  16  17  18
D  19  20  21  22  23  24
E  25  26  27  28  29  30
F  31  32  33  34  35  36

In [0]:
#show first five value
df.head(4)
df

    w   x   y   p   q   r
A   1   2   3   4   5   6
B   7   8   9  10  11  12
C  13  14  15  16  17  18
D  19  20  21  22  23  24
E  25  26  27  28  29  30
F  31  32  33  34  35  36

In [0]:
#Show last five value
df.tail()
print(df)

    w   x   y   p   q   r
A   1   2   3   4   5   6
B   7   8   9  10  11  12
C  13  14  15  16  17  18
D  19  20  21  22  23  24
E  25  26  27  28  29  30
F  31  32  33  34  35  36

In [0]:
df.sample(n=2) # return 2 random rows
df

    w   x   y   p   q   r
A   1   2   3   4   5   6
B   7   8   9  10  11  12
C  13  14  15  16  17  18
D  19  20  21  22  23  24
E  25  26  27  28  29  30
F  31  32  33  34  35  36

In [0]:
df.sample(frac=.25) # return 25% random rows
df

    w   x   y   p   q   r
A   1   2   3   4   5   6
B   7   8   9  10  11  12
C  13  14  15  16  17  18
D  19  20  21  22  23  24
E  25  26  27  28  29  30
F  31  32  33  34  35  36

In [0]:
df.nlargest(n=2, columns='x') # returns 2 rows for largest X
df

   w  x  y
A  1  2  3
B  4  5  6
C  7  8  9

In [0]:
df.nsmallest(n=2, columns='x') # returns 2 rows for smallest X
df

   w  x  y
A  1  2  3
B  4  5  6
C  7  8  9

In [0]:
df.index # RangeIndex
df

In [0]:
df.columns # nparray of column names
df

   w  x  y
A  1  2  3
B  4  5  6
C  7  8  9

In [0]:
df.axes # index and columns
df

   w  x  y
A  1  2  3
B  4  5  6
C  7  8  9

In [0]:
df.values # nparray of nparrays
df

   w  x  y
A  1  2  3
B  4  5  6
C  7  8  9

In [0]:
df.dtypes # series
df

   w  x  y
A  1  2  3
B  4  5  6
C  7  8  9

In [0]:
df.shape # tuple
df

   w  x  y
A  1  2  3
B  4  5  6
C  7  8  9

In [0]:
df.get_dtype_counts() # count number of columns for each datatype
df

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: `get_dtype_counts` has been deprecated and will be removed in a future version. For DataFrames use `.dtypes.value_counts()
  """Entry point for launching an IPython kernel.

   w  x  y
A  1  2  3
B  4  5  6
C  7  8  9

In [0]:
df.sum() # sums summable columns into a series (where column names become the index)
df

   w  x  y
A  1  2  3
B  4  5  6
C  7  8  9

In [0]:
df.sum(axis = "columns")

# methods for columns

In [0]:

df.sort_values(by=['X','Y'], ascending=[False,True]) # sort df by column X (descending) then Y (ascending)
df['X'].isnull() # series of booleans
df['X'].rank() # rank values in column X in ascending order
df['X'].unique() # nparray: unique values from column X
df['X'].nunique() # number of unique values from column X, does not include null by default!
df['X'].value_counts() # returns count of each value from column X
df.drop_duplicates(subset = ['X'], keep ="first") # keep only first instance of X values

# index-related

In [0]:

df.set_index('X') # sets column X as the index
df.set_index('Y') # sets column Y as the index, removes column X!
df.reset_index() # resets index (removes current index, resets dataframe, inserts new index starting from 0)
df.sort_index() # important for optimization

# parse columns

In [0]:

df.astype(int) # convert to int
df['X'].astype("category") # convert to category (important for optimization)
pd.to_datetime(df['X']) # convert to date (important for optimization)

# rename columns

In [0]:

df.rename(columns = {'X': 'A', 'Y': 'B'}, inplace=True)
df.columns = ['X', 'Y', 'Z', 'XX', 'YY', 'ZZ']

# selecting with conditional operators

In [0]:
# create mask, which is a series of booleans
mask1 = df['X'] < 5
mask2 = df['Y'].isin([4,5,6])
mask3 = df['Y'].isnull()
mask4 = df['Y'].notnull()
mask5 = df['Y'].between(4,6)
mask6 = df['Y'].duplicated(keep = False) # return True if duplicated
mask7 = ~df['Y'].duplicated(keep = False) # return True if unique

# use mask to select from dataframe

In [0]:
df[mask1] # return rows where X<5
df[mask1][['X','Y']] # return only columns X and Y
df[mask1 & mask2]
df[mask1 | mask2]
df[(mask1 | mask2) & mask3]
df.where(mask1) # return NaN for entire row when condition not met

# missing values - dropna and fillna

In [0]:
df.dropna() # removes any rows with NaN values (how = "any" by default)
df.dropna(how="all") # removes rows with all NaN values
df.dropna(subset=["X"]) # remove rows where value is NaN in column X
df.dropna(axis=1,thresh=10) # drop all columns containing at least 10 NaN values

In [0]:
#NaN Value


df.fillna(0) # replace all NaN values with 0
df['Y'].fillna(0, inplace=True) # replace all NaN values in column 'Y' with 0
df['X'].fillna(value=df['XX'].mean()) # replace NaN on column X with mean of column XX

# concat

In [0]:
df1 = pd.DataFrame(np.random.randn(5, 5), columns=['a', 'b', 'c', 'd', 'e'], index=['v','w','x','y','z'])
df2 = pd.DataFrame(np.random.randn(5, 5), columns=['a', 'b', 'c', 'd', 'e'], index=['v','w','x','y','z'])
df3 = pd.DataFrame(np.random.randn(5, 5), columns=['a', 'b', 'c', 'd', 'e'], index=['v','w','x','y','z'])
pd.concat([df1,df2,df3]) # concat vertically (match columns)
pd.concat([df1,df2,df3],axis=1) # concat horizontally (match rows)

#### merge (== join)

In [0]:
left = pd.DataFrame([[1,'A'],[1,'B'],[2,'B']], columns=['C1','C2'], index=['I1','I2','I3'])
right = pd.DataFrame([['B','C','D']], columns=['C2','C3','C4'], index=['I1'])
pd.merge(left,right,how='inner',on='C2') # same as inner join in sql (concats horizontally)

# pivot tables

In [0]:
pivot = {'A': ['foo','foo','foo','bar','bar','bar'],
         'B': ['one','one','two','two','one','one'],
         'C': ['x','y','x','y','x','y'],
         'D': [1,3,2,5,4,1]}
df = pd.DataFrame(pivot)
df.pivot_table(values='D',index=['A','B'],columns=['C'])

#multi-level index dataframes (ie dataframes within dataframes)

In [0]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = pd.MultiIndex.from_tuples(list(zip(outside,inside)))
df = pd.DataFrame(np.arange(1,13).reshape(6,2),hier_index,['A','B'])
df.index.names = ['Groups','Num']
df.loc['G1'].loc[1]['A'] # access elements using multiple loc
df.xs(1,level='Num') # return rows where 'num'=1